tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_sci.h
  const uint8_t                 *pTxBuffPtr;         /*!< Pointer to SCI Tx transfer Buffer */

  uint32_t                      TxXferSize;          /*!< SCI Tx Transfer size              */

  __IO uint32_t                 TxXferCount;         /*!< SCI Tx Transfer Counter           */

  uint8_t                       *pRxBuffPtr;         /*!< Pointer to SCI Rx transfer Buffer */

  uint32_t                      RxXferSize;          /*!< SCI Rx Transfer size              */

  __IO uint32_t                 RxXferCount;         /*!< SCI Rx Transfer Counter           */

  uint16_t                      Mask;                /*!< SCI Rx RDR register mask          */

  uint32_t                      NbRxDataToProcess;   /*!< Number of data to process during RX SR execution */

  uint32_t                      NbTxDataToProcess;   /*!< Number of data to process during TX SR execution */

  __IO HAL_SCI_RxTypeTypeDef    ReceptionType;       /*!< Type of ongoing reception          */

  __IO HAL_SCI_RxEventTypeTypeDef RxEventType;       /*!< Type of Rx Event                   */

  void (*RxISR)(struct __SCI_HandleTypeDef *hsci);   /*!< Function pointer on Rx IRQ handler */

  void (*TxISR)(struct __SCI_HandleTypeDef *hsci);   /*!< Function pointer on Tx IRQ handler  */

  DMA_HandleTypeDef             *hdmatx;             /*!< SCI Tx DMA Handle parameters      */

  DMA_HandleTypeDef             *hdmarx;             /*!< SCI Rx DMA Handle parameters      */

  HAL_LockTypeDef               Lock;                /*!< Locking object                      */

  __IO HAL_SCI_StateTypeDef     gState;              /*!< SCI communication state           */

  __IO HAL_SCI_StateTypeDef     RxState;             /*!< SCI state information related to Rx operations.
                                                          This parameter can be a value of @ref HAL_SCI_StateTypeDef */

  __IO uint32_t                 ErrorCode;           /*!< SCI Error code                    */

#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
  void (* TxBlockCpltCallback)(struct __SCI_HandleTypeDef *hsci);       /*!< SCI Tx Block Complete Callback       */
  void (* TxHalfBlockCpltCallback)(struct __SCI_HandleTypeDef *hsci);   /*!< SCI Tx Half Block Complete Callback  */
  void (* TxCpltCallback)(struct __SCI_HandleTypeDef *hsci);            /*!< SCI Tx Complete Callback             */
  void (* RxBlockCpltCallback)(struct __SCI_HandleTypeDef *hsci);       /*!< SCI Rx Block Complete Callback       */
  void (* RxHalfBlockCpltCallback)(struct __SCI_HandleTypeDef *hsci);   /*!< SCI Rx Half Block Complete Callback  */
  void (* RxCpltCallback)(struct __SCI_HandleTypeDef *hsci);            /*!< SCI Rx Complete Callback             */
  void (* ErrorCallback)(struct __SCI_HandleTypeDef *hsci);             /*!< SCI Error Callback                   */
  void (* AbortCpltCallback)(struct __SCI_HandleTypeDef *hsci);         /*!< SCI Abort Complete Callback          */
  void (* AbortTransmitCpltCallback)(struct __SCI_HandleTypeDef *hsci); /*!< SCI Abort Transmit Complete Callback */
  void (* AbortReceiveCpltCallback)(struct __SCI_HandleTypeDef *hsci);  /*!< SCI Abort Receive Complete Callback  */
  void (* WakeupCallback)(struct __SCI_HandleTypeDef *hsci);            /*!< SCI Wakeup Callback                  */
  void (* RxEventCallback)(struct __SCI_HandleTypeDef *hsci, uint32_t Pos); /*!< SCI Reception Event Callback     */

  void (* MspInitCallback)(struct __SCI_HandleTypeDef *hsci);           /*!< SCI Msp Init callback                */
  void (* MspDeInitCallback)(struct __SCI_HandleTypeDef *hsci);         /*!< SCI Msp DeInit callback              */
#endif  /* USE_HAL_SCI_REGISTER_CALLBACKS */

} SCI_HandleTypeDef;

#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL SCI Callback ID enumeration definition
  */
typedef enum
{
  HAL_SCI_TX_BLOCKCOMPLETE_CB_ID        = 0x00U,    /*!< SCI Tx Block Complete Callback ID       */
  HAL_SCI_TX_HALFBLOCKCOMPLETE_CB_ID    = 0x01U,    /*!< SCI Tx Half Block Complete Callback ID  */
  HAL_SCI_TX_COMPLETE_CB_ID             = 0x02U,    /*!< SCI Tx Complete Callback ID             */
  HAL_SCI_RX_BLOCKCOMPLETE_CB_ID        = 0x03U,    /*!< SCI Rx Block Complete Callback ID       */
  HAL_SCI_RX_HALFBLOCKCOMPLETE_CB_ID    = 0x04U,    /*!< SCI Rx Half Block Complete Callback ID  */
  HAL_SCI_RX_COMPLETE_CB_ID             = 0x05U,    /*!< SCI Rx Complete Callback ID             */
  HAL_SCI_ERROR_CB_ID                   = 0x06U,    /*!< SCI Error Callback ID                   */
  HAL_SCI_ABORT_COMPLETE_CB_ID          = 0x07U,    /*!< SCI Abort Complete Callback ID          */
  HAL_SCI_ABORT_TRANSMIT_COMPLETE_CB_ID = 0x08U,    /*!< SCI Abort Transmit Complete Callback ID */
  HAL_SCI_ABORT_RECEIVE_COMPLETE_CB_ID  = 0x09U,    /*!< SCI Abort Receive Complete Callback ID  */
  HAL_SCI_WAKEUP_CB_ID                  = 0x0AU,    /*!< SCI Wakeup Callback ID                  */

  HAL_SCI_MSPINIT_CB_ID                 = 0x0BU,    /*!< SCI MspInit callback ID                 */
  HAL_SCI_MSPDEINIT_CB_ID               = 0x0CU     /*!< SCI MspDeInit callback ID               */

} HAL_SCI_CallbackIDTypeDef;

/**
  * @brief  HAL SCI Callback pointer definition
  */
typedef  void (*pSCI_CallbackTypeDef)(SCI_HandleTypeDef *hsci);  /*!< pointer to an SCI callback function */
typedef  void (*pSCI_RxEventCallbackTypeDef)
(struct __SCI_HandleTypeDef *h, uint32_t Pos); /*!< pointer to a SCI Rx Event specific callback function */

#endif /* USE_HAL_SCI_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup SCI_Exported_Constants SCI Exported Constants
  * @{
  */

/** @defgroup SCI_Error_Definition   SCI Error Definition
  * @{
  */
#define HAL_SCI_ERROR_NONE             (0x00000000U)    /*!< No error                  */
#define HAL_SCI_ERROR_PE               (0x00000001U)    /*!< Parity error              */
#define HAL_SCI_ERROR_NE               (0x00000002U)    /*!< Noise error               */
#define HAL_SCI_ERROR_FE               (0x00000004U)    /*!< Frame error               */
#define HAL_SCI_ERROR_ORE              (0x00000008U)    /*!< Overrun error             */
#define HAL_SCI_ERROR_DMA              (0x00000010U)    /*!< DMA transfer error        */
#define HAL_SCI_ERROR_RTO              (0x00000020U)    /*!< Receiver Timeout error  */
#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
#define HAL_SCI_ERROR_INVALID_CALLBACK (0x00000040U)    /*!< Invalid Callback error    */
#endif /* USE_HAL_SCI_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup SCI_Stop_Bits  SCI Number of Stop Bits
  * @{
  */
#define SCI_STOPBITS_0_5                   USART_CR2_STOP_0                     /*!< SCI frame with 0.5 stop bit  */
#define SCI_STOPBITS_1                     0x00000000U                          /*!< SCI frame with 1 stop bit    */
#define SCI_STOPBITS_1_5                  (USART_CR2_STOP_0 | USART_CR2_STOP_1) /*!< SCI frame with 1.5 stop bits */
#define SCI_STOPBITS_2                     USART_CR2_STOP_1                     /*!< SCI frame with 2 stop bits   */
/**
  * @}
  */

/** @defgroup SCI_Parity    SCI Parity
  * @{
  */
#define SCI_PARITY_NONE                    0x00000000U                      /*!< No parity   */
#define SCI_PARITY_EVEN                    USART_CR1_PCE                    /*!< Even parity */
#define SCI_PARITY_ODD                     (USART_CR1_PCE | USART_CR1_PS)   /*!< Odd parity  */
/**
  * @}
  */

/** @defgroup SCI_Hardware_Flow_Control SCI Hardware Flow Control
  * @{
  */
#define SCI_HWCONTROL_NONE                 0x00000000U                       /*!< No hardware control       */
#define SCI_HWCONTROL_RTS                  USART_CR3_RTSE                    /*!< Request To Send           */
#define SCI_HWCONTROL_CTS                  USART_CR3_CTSE                    /*!< Clear To Send             */
#define SCI_HWCONTROL_RTS_CTS              (USART_CR3_RTSE | USART_CR3_CTSE) /*!< Request and Clear To Send */
/**
  * @}
  */

