tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_sci.h
/** @defgroup SCI_CR1_DEDT_ADDRESS_LSB_POS    SCI Driver Enable DeAssertion Time LSB Position In CR3 Register
  * @{
  */
#define SCI_CR3_DEDT_ADDRESS_LSB_POS       19U      /*!< SCI Driver Enable de-assertion time LSB
                                                         position in CR1 register */
/**
  * @}
  */

/** @defgroup SCI_Interruption_Mask    SCI Interruptions Flag Mask
  * @{
  */
#define SCI_IT_MASK                        0x001FU  /*!< SCI interruptions flags mask */
/**
  * @}
  */

/** @defgroup SCI_TimeOut_Value    SCI polling-based communications time-out value
  * @{
  */
#define HAL_SCI_TIMEOUT_VALUE              0x1FFFFFFU  /*!< SCI polling-based communications time-out value */
/**
  * @}
  */

/** @defgroup SCI_Flags      SCI Flags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the SR register
  * @{
  */
#define SCI_FLAG_TXBUSY                   USART_SR_TXBUSY        /*!< SCI TX busy flag                         */
#define SCI_FLAG_RXBUSY                   USART_SR_RXBUSY        /*!< SCI RX busy flag                         */
#define SCI_FLAG_RTOF                     USART_SR_RTOF          /*!< SCI receiver timeout flag                */
#define SCI_FLAG_ABRRQ                    USART_SR_ABRRQ         /*!< SCI auto BRR request flag                */
#define SCI_FLAG_ABRE                     USART_SR_ABRE          /*!< SCI auto BRR error flag                  */
#define SCI_FLAG_ABRF                     USART_SR_ABRF          /*!< SCI auto BRR detection flag              */
#define SCI_FLAG_CTS                      USART_SR_CTS           /*!< SCI CTS flag                             */
#define SCI_FLAG_LBD                      USART_SR_LBD           /*!< SCI LIN break detection flag             */
#define SCI_FLAG_TXE                      USART_SR_TXE           /*!< SCI transmit data register empty         */
#define SCI_FLAG_TC                       USART_SR_TC            /*!< SCI transmission complete                */
#define SCI_FLAG_RXNE                     USART_SR_RXNE          /*!< SCI read data register not empty         */
#define SCI_FLAG_IDLE                     USART_SR_IDLE          /*!< SCI idle flag                            */
#define SCI_FLAG_ORE                      USART_SR_ORE           /*!< SCI overrun error                        */
#define SCI_FLAG_NE                       USART_SR_NE            /*!< SCI noise error                          */
#define SCI_FLAG_FE                       USART_SR_FE            /*!< SCI frame error                          */
#define SCI_FLAG_PE                       USART_SR_PE            /*!< SCI parity error                         */
/**
  * @}
  */
/** @defgroup SCI_Private_Constants SCI Private Constants
  * @{
  */
/** @brief SCI interruptions flag mask
  *
  */

#define SCI_CR1_REG_INDEX               1U
#define SCI_CR2_REG_INDEX               2U
#define SCI_CR3_REG_INDEX               3U
/**
  * @}
  */

/** @defgroup SCI_Interrupt_definition SCI Interrupts Definition

  *        Elements values convention: 000ZZZZZ0XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *           - ZZZZZ  : Flag position in the SR register(5bits)
  *        Elements values convention: 000000000XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *        Elements values convention: 000ZZZZZ00000000b
  *           - ZZZZZ  : Flag position in the SR register(5bits)
  * @{
  */

#define SCI_IT_PE                          0x0028U  /*!< SCI parity error interruption                 */
#define SCI_IT_TXE                         0x0727U  /*!< SCI transmit data register empty interruption */
#define SCI_IT_TC                          0x0626U  /*!< SCI transmission complete interruption        */
#define SCI_IT_RXNE                        0x0525U  /*!< SCI read data register not empty interruption */
#define SCI_IT_IDLE                        0x0424U  /*!< SCI idle interruption                         */
#define SCI_IT_LBD                         0x0846U  /*!< SCI LBD interruption                          */
#define SCI_IT_RTO                         0x137DU  /*!< SCI RTO interruption                          */
#define SCI_IT_CTS                         0x096AU  /*!< SCI CTS interruption                          */

#define SCI_IT_ERR                         0x0060U  /*!< SCI error interruption                        */
#define SCI_IT_ORE                         0x0300U  /*!< SCI overrun error interruption                */
#define SCI_IT_NE                          0x0200U  /*!< SCI noise error interruption                  */
#define SCI_IT_FE                          0x0100U  /*!< SCI frame error interruption                  */

/**
  * @}
  */


/** @defgroup SCI_Reception_Type_Values  SCI Reception type values
  * @{
  */
#define HAL_SCI_RECEPTION_STANDARD          (0x00000000U)             /*!< Standard reception                       */
#define HAL_SCI_RECEPTION_TOIDLE            (0x00000001U)             /*!< Reception till completion or IDLE event  */
#define HAL_SCI_RECEPTION_TORTO             (0x00000002U)             /*!< Reception till completion or RTO event   */
#define HAL_SCI_RECEPTION_TOCHARMATCH       (0x00000003U)             /*!< Reception till completion or CM event    */
/**
  * @}
  */

/** @defgroup SCI_RxEvent_Type_Values  SCI RxEvent type values
  * @{
  */
#define HAL_SCI_RXEVENT_TC                  (0x00000000U)             /*!< RxEvent linked to Transfer Complete event */
#define HAL_SCI_RXEVENT_HT                  (0x00000001U)             /*!< RxEvent linked to Half Transfer event     */
#define HAL_SCI_RXEVENT_IDLE                (0x00000002U)             /*!< RxEvent linked to IDLE event              */
/**
  * @}
  */

/**
  * @}
  */
 
/* Exported macros -----------------------------------------------------------*/
/** @defgroup SCI_Exported_Macros SCI Exported Macros
  * @{
  */

