tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_sci.h
/* Private macros --------------------------------------------------------*/
/** @defgroup SCI_Private_Macros   SCI Private Macros
  * @{
  */

/** @brief  Check SCI Baud rate.
  * @param  __BAUDRATE__ Baudrate specified by the user.
  *         The maximum Baud Rate is derived from the maximum clock on E4
  *         divided by the smallest oversampling used on the SCI
  * @retval SET (__BAUDRATE__ is valid) or RESET (__BAUDRATE__ is invalid)  */
#define IS_SCI_BAUDRATE(__BAUDRATE__) ((__BAUDRATE__) <= 4500000U)

/** @brief  Check SCI assertion time.
  * @param  __TIME__ 5-bit value assertion time.
  * @retval Test result (TRUE or FALSE).
  */
#define IS_SCI_ASSERTIONTIME(__TIME__)    ((__TIME__) <= 0x1FU)

/** @brief  Check SCI deassertion time.
  * @param  __TIME__ 5-bit value deassertion time.
  * @retval Test result (TRUE or FALSE).
  */
#define IS_SCI_DEASSERTIONTIME(__TIME__) ((__TIME__) <= 0x1FU)

/**
  * @brief Ensure that SCI frame number of stop bits is valid.
  * @param __STOPBITS__ SCI frame number of stop bits.
  * @retval SET (__STOPBITS__ is valid) or RESET (__STOPBITS__ is invalid)
  */
#define IS_SCI_STOPBITS(__STOPBITS__) (((__STOPBITS__)   == SCI_STOPBITS_0_5) || \
                                         ((__STOPBITS__) == SCI_STOPBITS_1)   || \
                                         ((__STOPBITS__) == SCI_STOPBITS_1_5) || \
                                         ((__STOPBITS__) == SCI_STOPBITS_2))
/**
  * @brief Ensure that SCI frame parity is valid.
  * @param __PARITY__ SCI frame parity.
  * @retval SET (__PARITY__ is valid) or RESET (__PARITY__ is invalid)
  */
#define IS_SCI_PARITY(__PARITY__) (((__PARITY__) == SCI_PARITY_NONE) || \
                                   ((__PARITY__) == SCI_PARITY_EVEN) || \
                                   ((__PARITY__) == SCI_PARITY_ODD))

/**
  * @brief Ensure that SCI hardware flow control is valid.
  * @param __CONTROL__ SCI hardware flow control.
  * @retval SET (__CONTROL__ is valid) or RESET (__CONTROL__ is invalid)
  */
#define IS_SCI_HARDWARE_FLOW_CONTROL(__CONTROL__)\
  (((__CONTROL__) == SCI_HWCONTROL_NONE) || \
   ((__CONTROL__) == SCI_HWCONTROL_RTS)  || \
   ((__CONTROL__) == SCI_HWCONTROL_CTS)  || \
   ((__CONTROL__) == SCI_HWCONTROL_RTS_CTS))

/**
  * @brief Ensure that SCI communication mode is valid.
  * @param __MODE__ SCI communication mode.
  * @retval SET (__MODE__ is valid) or RESET (__MODE__ is invalid)
  */
#define IS_SCI_MODE(__MODE__) ((((__MODE__) & (~((uint32_t)(SCI_MODE_TX_RX)))) == 0x00U) && ((__MODE__) != 0x00U))

/**
  * @brief Ensure that SCI state is valid.
  * @param __STATE__ SCI state.
  * @retval SET (__STATE__ is valid) or RESET (__STATE__ is invalid)
  */
#define IS_SCI_STATE(__STATE__) (((__STATE__) == SCI_STATE_DISABLE) || \
                                 ((__STATE__) == SCI_STATE_ENABLE))

/**
  * @brief Ensure that SCI oversampling is valid.
  * @param __SAMPLING__ SCI oversampling.
  * @retval SET (__SAMPLING__ is valid) or RESET (__SAMPLING__ is invalid)
  */
#define IS_SCI_OVERSAMPLING(__SAMPLING__) (((__SAMPLING__) == SCI_OVERSAMPLING_16) || \
                                           ((__SAMPLING__) == SCI_OVERSAMPLING_8))

/**
  * @brief Ensure that SCI auto Baud rate detection mode is valid.
  * @param __MODE__ SCI auto Baud rate detection mode.
  * @retval SET (__MODE__ is valid) or RESET (__MODE__ is invalid)
  */
#define IS_SCI_ADVFEATURE_AUTOBAUDRATEMODE(__MODE__)  (((__MODE__) == SCI_ADVFEATURE_AUTOBAUDRATE_ONSTARTBIT)    || \
                                                       ((__MODE__) == SCI_ADVFEATURE_AUTOBAUDRATE_ONFALLINGEDGE) || \
                                                       ((__MODE__) == SCI_ADVFEATURE_AUTOBAUDRATE_ON0X7FFRAME)   || \
                                                       ((__MODE__) == SCI_ADVFEATURE_AUTOBAUDRATE_ON0X55FRAME))

/**
  * @brief Ensure that SCI receiver timeout setting is valid.
  * @param __TIMEOUT__ SCI receiver timeout setting.
  * @retval SET (__TIMEOUT__ is valid) or RESET (__TIMEOUT__ is invalid)
  */
#define IS_SCI_RECEIVER_TIMEOUT(__TIMEOUT__)  (((__TIMEOUT__) == SCI_RECEIVER_TIMEOUT_DISABLE) || \
                                               ((__TIMEOUT__) == SCI_RECEIVER_TIMEOUT_ENABLE))

/** @brief  Check the receiver timeout value.
  * @note   The maximum SCI receiver timeout value is 0xFFFFFF.
  * @param  __TIMEOUTVALUE__ receiver timeout value.
  * @retval Test result (TRUE or FALSE)
  */
#define IS_SCI_RECEIVER_TIMEOUT_VALUE(__TIMEOUTVALUE__)  ((__TIMEOUTVALUE__) <= 0xFFFFFFU)

/**
  * @brief Ensure that SCI LIN state is valid.
  * @param __LIN__ SCI LIN state.
  * @retval SET (__LIN__ is valid) or RESET (__LIN__ is invalid)
  */
#define IS_SCI_LIN(__LIN__)        (((__LIN__) == SCI_LIN_DISABLE) || \
                                    ((__LIN__) == SCI_LIN_ENABLE))

/**
  * @brief Ensure that SCI LIN break detection length is valid.
  * @param __LENGTH__ SCI LIN break detection length.
  * @retval SET (__LENGTH__ is valid) or RESET (__LENGTH__ is invalid)
  */
#define IS_SCI_LIN_BREAK_DETECT_LENGTH(__LENGTH__) (((__LENGTH__) == SCI_LINBREAKDETECTLENGTH_10B) || \
                                                    ((__LENGTH__) == SCI_LINBREAKDETECTLENGTH_11B))

/**
  * @brief Ensure that SCI DMA TX state is valid.
  * @param __DMATX__ SCI DMA TX state.
  * @retval SET (__DMATX__ is valid) or RESET (__DMATX__ is invalid)
  */
#define IS_SCI_DMA_TX(__DMATX__)     (((__DMATX__) == SCI_DMA_TX_DISABLE) || \
                                      ((__DMATX__) == SCI_DMA_TX_ENABLE))

/**
  * @brief Ensure that SCI DMA RX state is valid.
  * @param __DMARX__ SCI DMA RX state.
  * @retval SET (__DMARX__ is valid) or RESET (__DMARX__ is invalid)
  */
#define IS_SCI_DMA_RX(__DMARX__)     (((__DMARX__) == SCI_DMA_RX_DISABLE) || \
                                      ((__DMARX__) == SCI_DMA_RX_ENABLE))

/**
  * @brief Ensure that SCI half-duplex state is valid.
  * @param __HDSEL__ SCI half-duplex state.
  * @retval SET (__HDSEL__ is valid) or RESET (__HDSEL__ is invalid)
  */
#define IS_SCI_HALF_DUPLEX(__HDSEL__)     (((__HDSEL__) == SCI_HALF_DUPLEX_DISABLE) || \
                                           ((__HDSEL__) == SCI_HALF_DUPLEX_ENABLE))

/**
  * @brief Ensure that SCI wakeup is valid.
  * @param WAKEUP SCI wakeup.
  * @retval SET (WAKEUP is valid) or RESET (WAKEUP is invalid)
  */
#define IS_SCI_WAKEUPMETHOD(WAKEUP) (((WAKEUP) == SCI_WAKEUPMETHOD_IDLELINE) || \
                                     ((WAKEUP) == SCI_WAKEUPMETHOD_ADDRESSMARK))
/**
  * @brief Ensure that SCI request parameter is valid.
  * @param __PARAM__ SCI request parameter.
  * @retval SET (__PARAM__ is valid) or RESET (__PARAM__ is invalid)
  */
#define IS_SCI_REQUEST_PARAMETER(__PARAM__) ((__PARAM__) == SCI_SENDBREAK_REQUEST)

/**
  * @brief Ensure that SCI advanced features initialization is valid.
  * @param __INIT__ SCI advanced features initialization.
  * @retval SET (__INIT__ is valid) or RESET (__INIT__ is invalid)
  */
#define IS_SCI_ADVFEATURE_INIT(__INIT__)   ((__INIT__) <=  (SCI_ADVFEATURE_NO_INIT                | \
                                                            SCI_ADVFEATURE_DATAINVERT_INIT        | \
                                                            SCI_ADVFEATURE_SWAP_INIT              | \
                                                            SCI_ADVFEATURE_AUTOBAUDRATE_INIT      | \
                                                            SCI_ADVFEATURE_MSBFIRST_INIT))

/**
  * @brief Ensure that SCI frame data inversion setting is valid.
  * @param __DATAINV__ SCI frame data inversion setting.
  * @retval SET (__DATAINV__ is valid) or RESET (__DATAINV__ is invalid)
  */
#define IS_SCI_ADVFEATURE_DATAINV(__DATAINV__)  (((__DATAINV__) == SCI_ADVFEATURE_DATAINV_DISABLE) || \
                                                 ((__DATAINV__) == SCI_ADVFEATURE_DATAINV_ENABLE))

/**
  * @brief Ensure that SCI frame RX/TX pins swap setting is valid.
  * @param __SWAP__ SCI frame RX/TX pins swap setting.
  * @retval SET (__SWAP__ is valid) or RESET (__SWAP__ is invalid)
  */
#define IS_SCI_ADVFEATURE_SWAP(__SWAP__)  (((__SWAP__) == SCI_ADVFEATURE_SWAP_DISABLE) || \
                                           ((__SWAP__) == SCI_ADVFEATURE_SWAP_ENABLE))

/**
  * @brief Ensure that SCI auto Baud rate state is valid.
  * @param __AUTOBAUDRATE__ SCI auto Baud rate state.
  * @retval SET (__AUTOBAUDRATE__ is valid) or RESET (__AUTOBAUDRATE__ is invalid)
  */
#define IS_SCI_ADVFEATURE_AUTOBAUDRATE(__AUTOBAUDRATE__)  (((__AUTOBAUDRATE__) == SCI_ADVFEATURE_AUTOBAUDRATE_DISABLE) || \
                                                           ((__AUTOBAUDRATE__) == SCI_ADVFEATURE_AUTOBAUDRATE_ENABLE))

/**
  * @brief Ensure that SCI frame MSB first setting is valid.
  * @param __MSBFIRST__ SCI frame MSB first setting.
  * @retval SET (__MSBFIRST__ is valid) or RESET (__MSBFIRST__ is invalid)
  */
#define IS_SCI_ADVFEATURE_MSBFIRST(__MSBFIRST__)  (((__MSBFIRST__) == SCI_ADVFEATURE_MSBFIRST_DISABLE) || \
                                                   ((__MSBFIRST__) == SCI_ADVFEATURE_MSBFIRST_ENABLE))

/** @brief  Check the receiver timeout value.
  * @note   The maximum SCI receiver timeout value is 0xFFFFFF.
  * @param  __TIMEOUTVALUE__ receiver timeout value.
  * @retval Test result (TRUE or FALSE)
  */
#define IS_SCI_RECEIVER_TIMEOUT_VALUE(__TIMEOUTVALUE__)  ((__TIMEOUTVALUE__) <= 0xFFFFFFU)

#define IS_SCI_ADDRESS(ADDRESS) ((ADDRESS) <= 0xFFU)

/**
  * @brief Ensure that SCI driver enable polarity is valid.
  * @param __POLARITY__ SCI driver enable polarity.
  * @retval SET (__POLARITY__ is valid) or RESET (__POLARITY__ is invalid)
  */
#define IS_SCI_DE_POLARITY(__POLARITY__)    (((__POLARITY__) == SCI_DE_POLARITY_HIGH) || \
                                             ((__POLARITY__) == SCI_DE_POLARITY_LOW))

#define IS_SCI_RX_MATCH_ADDR(ADDR) ((ADDR) <= 0xFF)


#define SCI_DIV_SAMPLING16(_PCLK_, _BAUD_)            (((_PCLK_)*25U)/(4U*(_BAUD_)))
#define SCI_DIVMANT_SAMPLING16(_PCLK_, _BAUD_)        (SCI_DIV_SAMPLING16((_PCLK_), (_BAUD_))/100U)
#define SCI_DIVFRAQ_SAMPLING16(_PCLK_, _BAUD_)        (((SCI_DIV_SAMPLING16((_PCLK_), (_BAUD_)) - (SCI_DIVMANT_SAMPLING16((_PCLK_), (_BAUD_)) * 100U)) * 16U + 50U) / 100U)
/* SCI BRR = mantissa + overflow + fraction
           = (SCI DIVMANT << 4) + (SCI DIVFRAQ & 0xF0) + (SCI DIVFRAQ & 0x0FU) */
#define SCI_BRR_SAMPLING16(_PCLK_, _BAUD_)            (((SCI_DIVMANT_SAMPLING16((_PCLK_), (_BAUD_)) << 4U) + \
                                                        (SCI_DIVFRAQ_SAMPLING16((_PCLK_), (_BAUD_)) & 0xF0U)) + \
                                                        (SCI_DIVFRAQ_SAMPLING16((_PCLK_), (_BAUD_)) & 0x0FU))

