tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_sci.h
#define SCI_DIV_SAMPLING8(_PCLK_, _BAUD_)             (((_PCLK_)*25U)/(2U*(_BAUD_)))
#define SCI_DIVMANT_SAMPLING8(_PCLK_, _BAUD_)         (SCI_DIV_SAMPLING8((_PCLK_), (_BAUD_))/100U)
#define SCI_DIVFRAQ_SAMPLING8(_PCLK_, _BAUD_)         (((SCI_DIV_SAMPLING8((_PCLK_), (_BAUD_)) - (SCI_DIVMANT_SAMPLING8((_PCLK_), (_BAUD_)) * 100U)) * 8U + 50U) / 100U)
/* SCI BRR = mantissa + overflow + fraction
           = (SCI DIVMANT << 4) + ((SCI DIVFRAQ & 0xF8) << 1) + (SCI DIVFRAQ & 0x07U) */
#define SCI_BRR_SAMPLING8(_PCLK_, _BAUD_)             (((SCI_DIVMANT_SAMPLING8((_PCLK_), (_BAUD_)) << 4U) + \
                                                        ((SCI_DIVFRAQ_SAMPLING8((_PCLK_), (_BAUD_)) & 0xF8U) << 1U)) + \
                                                        (SCI_DIVFRAQ_SAMPLING8((_PCLK_), (_BAUD_)) & 0x07U))

/**
  * @}
  */


#include "py32f032_hal_sci_ex.h"
/* Exported functions --------------------------------------------------------*/
/** @addtogroup SCI_Exported_Functions
  * @{
  */
/** @addtogroup SCI_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */

/* Initialization/de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_SCI_Init(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_HalfDuplex_Init(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_LIN_Init(SCI_HandleTypeDef *hsci, uint32_t BreakDetectLength);
HAL_StatusTypeDef HAL_MultiProcessor_Init(SCI_HandleTypeDef *hsci, uint8_t Address, uint32_t WakeUpMethod);
HAL_StatusTypeDef HAL_SCI_DeInit(SCI_HandleTypeDef *hsci);
void HAL_SCI_MspInit(SCI_HandleTypeDef *hsci);
void HAL_SCI_MspDeInit(SCI_HandleTypeDef *hsci);

/* Callbacks Register/UnRegister functions  ***********************************/
#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
HAL_StatusTypeDef HAL_SCI_RegisterCallback(SCI_HandleTypeDef *hsci, HAL_SCI_CallbackIDTypeDef CallbackID, pSCI_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_SCI_UnRegisterCallback(SCI_HandleTypeDef *hsci, HAL_SCI_CallbackIDTypeDef CallbackID);
HAL_StatusTypeDef HAL_SCI_RegisterRxEventCallback(SCI_HandleTypeDef *hsci, pSCI_RxEventCallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_SCI_UnRegisterRxEventCallback(SCI_HandleTypeDef *hsci);
#endif /* USE_HAL_SCI_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup SCI_Exported_Functions_Group2 IO operation functions
  * @{
  */

/* IO operation functions *******************************************************/
HAL_StatusTypeDef HAL_SCI_Transmit(SCI_HandleTypeDef *hsci, uint8_t *pData, uint32_t Size, uint32_t Timeout);
HAL_StatusTypeDef HAL_SCI_Receive(SCI_HandleTypeDef *hsci, uint8_t *pData, uint32_t Size, uint32_t Timeout);
HAL_StatusTypeDef HAL_SCI_Transmit_IT(SCI_HandleTypeDef *hsci, uint8_t *pData, uint32_t Size);
HAL_StatusTypeDef HAL_SCI_Receive_IT(SCI_HandleTypeDef *hsci, uint8_t *pData, uint32_t Size);
HAL_StatusTypeDef HAL_SCI_Transmit_DMA(SCI_HandleTypeDef *hsci, uint8_t *pData, uint32_t Size);
HAL_StatusTypeDef HAL_SCI_Receive_DMA(SCI_HandleTypeDef *hsci, uint8_t *pRxData, uint32_t Size);
HAL_StatusTypeDef HAL_SCI_DMAPause(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_DMAResume(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_DMAStop(SCI_HandleTypeDef *hsci);
/* Transfer Abort functions */
HAL_StatusTypeDef HAL_SCI_Abort(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_AbortTransmit(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_AbortReceive(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_Abort_IT(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_AbortTransmit_IT(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_AbortReceive_IT(SCI_HandleTypeDef *hsci);

void HAL_SCI_IRQHandler(SCI_HandleTypeDef *hsci);
void HAL_SCI_TxCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_TxBlockCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_TxHalfBlockCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_TxSrcCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_RxCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_RxBlockCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_RxHalfBlockCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_RxDstCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_ErrorCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_AbortCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_AbortTransmitCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_AbortReceiveCpltCallback(SCI_HandleTypeDef *hsci);
void HAL_SCI_IdleFrameDetectCpltCallback(SCI_HandleTypeDef *hsci);

void HAL_SCIEx_RxEventCallback(SCI_HandleTypeDef *hsci, uint32_t Size);

/**
  * @}
  */

/** @addtogroup SCI_Exported_Functions_Group3
  * @{
  */

/* Peripheral Control functions  ************************************************/
void HAL_SCI_ReceiverTimeout_Config(SCI_HandleTypeDef *hsci, uint32_t TimeoutValue);
HAL_StatusTypeDef HAL_SCI_EnableReceiverTimeout(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_SCI_DisableReceiverTimeout(SCI_HandleTypeDef *hsci);

HAL_StatusTypeDef HAL_LIN_SendBreak(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_MultiProcessor_EnableMuteMode(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_MultiProcessor_DisableMuteMode(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_MultiProcessor_EnterMuteMode(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_HalfDuplex_EnableTransmitter(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef HAL_HalfDuplex_EnableReceiver(SCI_HandleTypeDef *hsci);

/**
  * @}
  */

/** @addtogroup SCI_Exported_Functions_Group4
  * @{
  */
/* Peripheral State functions  **************************************************/
HAL_SCI_StateTypeDef HAL_SCI_GetState(SCI_HandleTypeDef *hsci);
uint32_t             HAL_SCI_GetError(SCI_HandleTypeDef *hsci);
/**
  * @}
  */

#if (USE_HAL_SCI_REGISTER_CALLBACKS == 1)
void              SCI_InitCallbacksToDefault(SCI_HandleTypeDef *hsci);
#endif /* USE_HAL_SCI_REGISTER_CALLBACKS */
void SCI_SetConfig(SCI_HandleTypeDef *hsci);
void SCI_AdvFeatureConfig(SCI_HandleTypeDef *hsci);
HAL_StatusTypeDef SCI_Start_Receive_IT(SCI_HandleTypeDef *hsci, uint8_t *pRxData, uint32_t Size);
HAL_StatusTypeDef SCI_Start_Receive_DMA(SCI_HandleTypeDef *hsci, uint8_t *pRxData, uint32_t Size);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif
#ifdef __cplusplus
}

#endif /* __PY32F032_HAL_SCI_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
